In [13]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [19]:
file_path = "C:\\Users\\DBRok\\Downloads\\Visadataset.csv"

visa_df = pd.read_csv(file_path)

visa_df

,case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
0,EZYV01,Asia,High School,N,N,14513,2007,West,592.2029,Hour,Y,Denied
1,EZYV02,Asia,Master's,Y,N,2412,2002,Northeast,83425.6500,Year,Y,Certified
2,EZYV03,Asia,Bachelor's,N,Y,44444,2008,West,122996.8600,Year,Y,Denied
3,EZYV04,Asia,Bachelor's,N,N,98,1897,West,83434.0300,Year,Y,Denied
4,EZYV05,Africa,Master's,Y,N,1082,2005,South,149907.3900,Year,Y,Certified
...,...,...,...,...,...,...,...,...,...,...,...,...
25475,EZYV25476,Asia,Bachelor's,Y,Y,2601,2008,South,77092.5700,Year,Y,Certified
25476,EZYV25477,Asia,High School,Y,N,3274,2006,Northeast,279174.7900,Year,Y,Certified
25477,EZYV25478,Asia,Master's,Y,N,1121,1910,South,146298.8500,Year,N,Certified
25478,EZYV25479,Asia,Master's,Y,Y,1918,1887,West,86154.7700,Year,Y,Certified
25479,EZYV25480,Asia,Bachelor's,Y,N,3195,1960,Midwest,70876.9100,Year,Y,Certified

**shape**


*shape will give you number of rows and columns*

In [23]:
visa_df.shape

(25480, 12)

In [25]:
type(visa_df)

pandas.core.frame.DataFrame

In [29]:
print('the number of rows are:', visa_df.shape[0])
print('the number of columns are:', visa_df.shape[1])

the number of rows are: 25480
the number of columns are: 12

In [ ]:
#<package_name>.<method_name>()

In [31]:
visa_df.shape()

TypeError: 'tuple' object is not callable

- Functions are used to call
- Functions means () 
- Not Callable means, remove the brackets because it is not a function.

**Size**

*number of rows * number of columns*

In [37]:
visa_df.size

# number of rows * number of columns

305760

In [39]:
visa_df.shape[0] * visa_df.shape[1]

#25480*12

305760

**Columns**

*it will retrive all the columns at one position*

In [45]:
visa_df.columns

Index(['case_id', 'continent', 'education_of_employee', 'has_job_experience',
       'requires_job_training', 'no_of_employees', 'yr_of_estab',
       'region_of_employment', 'prevailing_wage', 'unit_of_wage',
       'full_time_position', 'case_status'],
      dtype='object')

In [47]:
type(visa_df.columns)

pandas.core.indexes.base.Index

In [49]:
visa_df.columns.to_list   # <-- you need to add brackets 
                          # to remove bound method.

<bound method IndexOpsMixin.tolist of Index(['case_id', 'continent', 'education_of_employee', 'has_job_experience',
       'requires_job_training', 'no_of_employees', 'yr_of_estab',
       'region_of_employment', 'prevailing_wage', 'unit_of_wage',
       'full_time_position', 'case_status'],
      dtype='object')>

In [51]:
visa_df.columns.to_list()

['case_id',
 'continent',
 'education_of_employee',
 'has_job_experience',
 'requires_job_training',
 'no_of_employees',
 'yr_of_estab',
 'region_of_employment',
 'prevailing_wage',
 'unit_of_wage',
 'full_time_position',
 'case_status']

- bound method means use the brackets

In [ ]:
dict() ====== to_dict
list() ====== to_list

**dtypes**

In [57]:
visa_df.dtypes

# object means categorical column
# int64 and float64

case_id                   object
continent                 object
education_of_employee     object
has_job_experience        object
requires_job_training     object
no_of_employees            int64
yr_of_estab                int64
region_of_employment      object
prevailing_wage          float64
unit_of_wage              object
full_time_position        object
case_status               object
dtype: object

In [59]:
type(visa_df.dtypes)

pandas.core.series.Series

In [61]:
visa_df.dtypes.index

Index(['case_id', 'continent', 'education_of_employee', 'has_job_experience',
       'requires_job_training', 'no_of_employees', 'yr_of_estab',
       'region_of_employment', 'prevailing_wage', 'unit_of_wage',
       'full_time_position', 'case_status'],
      dtype='object')

In [65]:
visa_df.dtypes.keys()

Index(['case_id', 'continent', 'education_of_employee', 'has_job_experience',
       'requires_job_training', 'no_of_employees', 'yr_of_estab',
       'region_of_employment', 'prevailing_wage', 'unit_of_wage',
       'full_time_position', 'case_status'],
      dtype='object')

In [ ]:
dir(visa_df.dtypes)

In [69]:
visa_df.dtypes.values

array([dtype('O'), dtype('O'), dtype('O'), dtype('O'), dtype('O'),
       dtype('int64'), dtype('int64'), dtype('O'), dtype('float64'),
       dtype('O'), dtype('O'), dtype('O')], dtype=object)

In [71]:
type(visa_df.dtypes.values)

numpy.ndarray

In [77]:
list1=[1,2,3]
list1
[1,2,3] + [4,5,6]

[1, 2, 3, 4, 5, 6]

In [79]:
np.array([1,2,3]) + np.array([4,5,6])

array([5, 7, 9])

In [ ]:
array[] ==== > numpy
index[] ==== > pandas index
pandas.dataframe
pandas.series

**TASK 01**

*Separate categorical columns, numerical columns in list*

In [82]:
visa_df.dtypes

# create two lists
# cat
# num

case_id                   object
continent                 object
education_of_employee     object
has_job_experience        object
requires_job_training     object
no_of_employees            int64
yr_of_estab                int64
region_of_employment      object
prevailing_wage          float64
unit_of_wage              object
full_time_position        object
case_status               object
dtype: object

In [100]:
dict(visa_df.dtypes)

{'case_id': dtype('O'),
 'continent': dtype('O'),
 'education_of_employee': dtype('O'),
 'has_job_experience': dtype('O'),
 'requires_job_training': dtype('O'),
 'no_of_employees': dtype('int64'),
 'yr_of_estab': dtype('int64'),
 'region_of_employment': dtype('O'),
 'prevailing_wage': dtype('float64'),
 'unit_of_wage': dtype('O'),
 'full_time_position': dtype('O'),
 'case_status': dtype('O')}

In [130]:
cat=[]
num=[]
dict1 = dict(visa_df.dtypes)

for i,j in dict(visa_df.dtypes).items():
    if j=='object':
        cat.append(i)
    else:
        num.append(i)
        
print(cat)
print('-'*40)
print(num)

['case_id', 'continent', 'education_of_employee', 'has_job_experience', 'requires_job_training', 'region_of_employment', 'unit_of_wage', 'full_time_position', 'case_status']
----------------------------------------
['no_of_employees', 'yr_of_estab', 'prevailing_wage']

In [128]:
cat = [key for key,value in dict1.items() if value=='object']
cat

['case_id',
 'continent',
 'education_of_employee',
 'has_job_experience',
 'requires_job_training',
 'region_of_employment',
 'unit_of_wage',
 'full_time_position',
 'case_status']

**head**

In [135]:
visa_df.head()  # top 5 rows
# starting index with 0

,case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
0,EZYV01,Asia,High School,N,N,14513,2007,West,592.2029,Hour,Y,Denied
1,EZYV02,Asia,Master's,Y,N,2412,2002,Northeast,83425.6500,Year,Y,Certified
2,EZYV03,Asia,Bachelor's,N,Y,44444,2008,West,122996.8600,Year,Y,Denied
3,EZYV04,Asia,Bachelor's,N,N,98,1897,West,83434.0300,Year,Y,Denied
4,EZYV05,Africa,Master's,Y,N,1082,2005,South,149907.3900,Year,Y,Certified

In [137]:
visa_df.head(3)

,case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
0,EZYV01,Asia,High School,N,N,14513,2007,West,592.2029,Hour,Y,Denied
1,EZYV02,Asia,Master's,Y,N,2412,2002,Northeast,83425.6500,Year,Y,Certified
2,EZYV03,Asia,Bachelor's,N,Y,44444,2008,West,122996.8600,Year,Y,Denied

**tail**

In [144]:
visa_df.tail() # last 5 rows will come

,case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
25475,EZYV25476,Asia,Bachelor's,Y,Y,2601,2008,South,77092.57,Year,Y,Certified
25476,EZYV25477,Asia,High School,Y,N,3274,2006,Northeast,279174.79,Year,Y,Certified
25477,EZYV25478,Asia,Master's,Y,N,1121,1910,South,146298.85,Year,N,Certified
25478,EZYV25479,Asia,Master's,Y,Y,1918,1887,West,86154.77,Year,Y,Certified
25479,EZYV25480,Asia,Bachelor's,Y,N,3195,1960,Midwest,70876.91,Year,Y,Certified

**take**

*will give you specific rows*

In [149]:
list1=[100,200,300]
visa_df.take(list1)

,case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
100,EZYV101,Asia,Master's,Y,N,2227,2007,Northeast,28243.79,Year,Y,Certified
200,EZYV201,Asia,Doctorate,Y,N,3282,1979,West,74441.11,Year,Y,Certified
300,EZYV301,Asia,Master's,Y,N,3268,2012,Midwest,101371.21,Year,Y,Certified

In [151]:
list1=[100,200,300]
visa_df.take(list1,axis=1)

# axis-1 means columns
# it will look for these 100 200 300 columns

IndexError: indices are out-of-bounds

In [157]:
visa_df.take([2,5,10],axis=1)

# in python index start with = 0
# 2 ==== 3rd column
# 5 ==== 6th column
# 10 ==== 11th column

      education_of_employee  no_of_employees full_time_position
0               High School            14513                  Y
1                  Master's             2412                  Y
2                Bachelor's            44444                  Y
3                Bachelor's               98                  Y
4                  Master's             1082                  Y
...                     ...              ...                ...
25475            Bachelor's             2601                  Y
25476           High School             3274                  Y
25477              Master's             1121                  N
25478              Master's             1918                  Y
25479            Bachelor's             3195                  Y

[25480 rows x 3 columns]

In [159]:
visa_df.take([2,5,10],axis=0)

,case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
2,EZYV03,Asia,Bachelor's,N,Y,44444,2008,West,122996.86,Year,Y,Denied
5,EZYV06,Asia,Master's,Y,N,2339,2012,South,78252.14,Year,Y,Certified
10,EZYV11,Asia,Master's,N,N,2465,2004,Midwest,83588.56,Year,Y,Certified

**TASK 02**

*i want 150,300,450 rows from 5,8,12 column*

In [214]:

columns = visa_df.take([4,7,11],axis=1)
rows = columns.take([150,300,450],axis=0)

rows

    requires_job_training region_of_employment case_status
150                     N                 West      Denied
300                     N              Midwest   Certified
450                     Y                 West      Denied

In [221]:
# this is sirs method
visa_df.take([4,7,11],axis=1).take([150,200,250])

    requires_job_training region_of_employment case_status
150                     N                 West      Denied
200                     N                 West   Certified
250                     N            Northeast   Certified

**iloc - loc**

In [ ]:
visa_df.iloc[ <rows>, <columns> ]
visa_df.iloc[ start:end, start:end ]

In [226]:
visa_df.iloc[100:105] # <--- takes all columns

,case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
100,EZYV101,Asia,Master's,Y,N,2227,2007,Northeast,28243.79,Year,Y,Certified
101,EZYV102,Asia,Master's,Y,N,334,2007,Midwest,43421.88,Year,Y,Certified
102,EZYV103,Asia,Bachelor's,Y,N,224,2008,Midwest,80253.78,Year,Y,Certified
103,EZYV104,Asia,Doctorate,Y,N,367,1982,West,115235.95,Year,Y,Certified
104,EZYV105,Asia,Master's,Y,N,306,2003,Northeast,95200.86,Year,N,Certified

In [232]:
visa_df.iloc[100:106, 5:9]

     no_of_employees  yr_of_estab region_of_employment  prevailing_wage
100             2227         2007            Northeast         28243.79
101              334         2007              Midwest         43421.88
102              224         2008              Midwest         80253.78
103              367         1982                 West        115235.95
104              306         2003            Northeast         95200.86
105             2317         1995               Island         41613.52

In [234]:
visa_df.iloc[[10,15,20],[5,8,11]]

    no_of_employees  prevailing_wage case_status
10             2465         83588.56   Certified
15             4897         74108.02      Denied
20              880         71128.98      Denied

In [236]:
visa_df.columns

Index(['case_id', 'continent', 'education_of_employee', 'has_job_experience',
       'requires_job_training', 'no_of_employees', 'yr_of_estab',
       'region_of_employment', 'prevailing_wage', 'unit_of_wage',
       'full_time_position', 'case_status'],
      dtype='object')

In [240]:
# 10,15,20 from only case status column
visa_df.iloc[[10,15,20],'case_status']

# iloc will only take numbers

ValueError: Location based indexing can only have [integer, integer slice (START point is INCLUDED, END point is EXCLUDED), listlike of integers, boolean array] types

In [242]:
visa_df.loc[[10,15,20],'case_status']

10    Certified
15       Denied
20       Denied
Name: case_status, dtype: object

In [246]:
# in loc you can provide below 2 things
# list of rows
# list of columns

visa_df.loc[[10,15,20],['case_status']]

   case_status
10   Certified
15      Denied
20      Denied

In [248]:
rows = [300,350,400]
cols = ['continent','case_status']
visa_df.loc[rows,cols]

    continent case_status
300      Asia   Certified
350      Asia      Denied
400    Europe   Certified

In [250]:
len(visa_df)

25480

**isnull**

- any missing values are there in the data set
- is null you are asking question to computer: True/False
- if any missing values are there it is True
- if data presents/no missing values False

In [254]:
visa_df.isnull()

,case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
0,False,False,False,False,False,False,False,False,False,False,False,False
1,False,False,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False,False,False,False
3,False,False,False,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False,False,False,False
...,...,...,...,...,...,...,...,...,...,...,...,...
25475,False,False,False,False,False,False,False,False,False,False,False,False
25476,False,False,False,False,False,False,False,False,False,False,False,False
25477,False,False,False,False,False,False,False,False,False,False,False,False
25478,False,False,False,False,False,False,False,False,False,False,False,False
25479,False,False,False,False,False,False,False,False,False,False,False,False

In [256]:
visa_df.isnull().sum()

case_id                  0
continent                0
education_of_employee    0
has_job_experience       0
requires_job_training    0
no_of_employees          0
yr_of_estab              0
region_of_employment     0
prevailing_wage          0
unit_of_wage             0
full_time_position       0
case_status              0
dtype: int64

**info**

In [259]:
visa_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 25480 entries, 0 to 25479
Data columns (total 12 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   case_id                25480 non-null  object
 1   continent              25480 non-null  object
 2   education_of_employee  25480 non-null  object
 3   has_job_experience     25480 non-null  object
 4   requires_job_training  25480 non-null  object
 5   no_of_employees        25480 non-null  int64
 6   yr_of_estab            25480 non-null  int64
 7   region_of_employment   25480 non-null  object
 8   prevailing_wage        25480 non-null  float64
 9   unit_of_wage           25480 non-null  object
 10  full_time_position     25480 non-null  object
 11  case_status            25480 non-null  object
dtypes: float64(1), int64(2), object(9)
memory usage: 2.3+ MB

In [ ]:
#- shape
#- size
#- dtypes
#- columns
#- we separated cat and num
#- head
#- tail
#- len
#- isnull
#- info
#- take
#- iloc
#- loc